## Students performance data obtained from Kaggle.com

Here is the file ->  [Get the csv file](https://www.kaggle.com/datasets/spscientist/students-performance-in-exams/data)

In [75]:
# importing the necessary libraries
import pandas as  pd
import pandas

### Load the data and create a dataframe

In [31]:
# loading the data and creating a dataframe
df = pd.read_csv('Desktop/DA_csv _files/StudentsPerformance.csv')

### Preview the data frame

In [32]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

### Display the total number of rows and columns in the dataframe

In [33]:
r, c = df.shape # unpacking the shape attribute 
print(f'{r} rows and {c} columns')

1000 rows and 8 columns

### Display the mathematical analysis for the numerical data

In [34]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

### Find the count of genders

In [44]:
# displaying the gender count using the value_counts function
df['gender'].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

### Create a pivot table that shows the average math score for both genders in specific race/ethnicity

In [45]:
# making a pivot table displaying the mean math score for specific gender and ethnicity
df.pivot_table(index= 'gender', columns= 'race/ethnicity', values= 'math score')

race/ethnicity    group A    group B    group C    group D    group E
gender
female          58.527778  61.403846  62.033333  65.248062  70.811594
male            63.735849  65.930233  67.611511  69.413534  76.746479

### Check the information of the dataframe and the datatypes for each column

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

### Display the top 5 students records of students with the highest math score

In [48]:
# Obtaining the records of the top five students with the highest math score using nlargets function
df.nlargest(5, 'math score')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
149,male,group E,associate's degree,free/reduced,completed,100,100,93
451,female,group E,some college,standard,none,100,92,97
458,female,group E,bachelor's degree,standard,none,100,100,100
623,male,group A,some college,standard,completed,100,96,86
625,male,group D,some college,standard,completed,100,97,99

### Display the bottom 5 students records of students with the lowest reading score

In [49]:
# Obtaining the records of the bottom five students with the lowest reding score using nsmallest function
df.nsmallest(5, 'reading score')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
59,female,group C,some high school,free/reduced,none,0,17,10
327,male,group A,some college,free/reduced,none,28,23,19
596,male,group B,high school,free/reduced,none,30,24,15
980,female,group B,high school,free/reduced,none,8,24,23
76,male,group E,some high school,standard,none,30,26,22

### Get the count of the students in the different levels of education

In [76]:
# getting the count of students in the different levels of education 
df['parental level of education'].value_counts()

parental level of education
some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: count, dtype: int64

### Display the record of the student who scored the highest in both math score and reading score in average

### Create a column that contains the grade of the students based off their average score in math, reading, and writing score

In [78]:
# updating tasks soon
# this data is too clean. I might do a messy one for my next project to sharpen my data cleaning skills